In [1]:
import numpy as np
import pandas as pd

In [32]:
df = pd.read_csv('adult.csv')
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [33]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
educational-num     int64
marital-status     object
occupation         object
relationship       object
race               object
gender             object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
income             object
dtype: object

In [64]:
#Data preprocessing
df.replace(' ?',np.nan, inplace = True)

In [65]:
#1. How many men and women (sex feature) are represented in this dataset?

df['gender'].value_counts()

 Male      21790
 Female    10771
Name: gender, dtype: int64

In [66]:
#2. What is the average age (age feature) of women?

print('Age for Females: ')
df[df['gender']=='Female'].mean()['age']

Age for Females:

nan

In [67]:
#3. What is the percentage of German citizens (native-country feature)?

(df[df['native-country']=='Germany'].count() /df['native-country'].value_counts().sum())['native-country']

0.0

In [68]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income,status
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,NaN
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,NaN
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,NaN
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,NaN
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,NaN

In [69]:
#4.What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?

print('Mean', df[df['income'] =='<=50K']['age'].mean())
print('STD',df[df['income'] =='<=50K']['age'].std())
print(' ')
print('Income : >50K')
print('Mean', df[df['income'] !='<=50K']['age'].mean())
print('STD',df[df['income'] !='<=50K']['age'].std())

Mean nan
STD nan

Income : >50K
Mean 38.58164675532078
STD 13.640432553581146

In [70]:
#5.Is it true that people who earn more than 50K have at least a high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

df[df['income']=='>50K']['education'].value_counts()

Series([], Name: education, dtype: int64)

In [48]:
#6. Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race. 
    
df.groupby(['race','gender'])['age'].max()

race                 gender
 Amer-Indian-Eskimo   Female    80
                      Male      82
 Asian-Pac-Islander   Female    75
                      Male      90
 Black                Female    90
                      Male      90
 Other                Female    74
                      Male      77
 White                Female    90
                      Male      90
Name: age, dtype: int64

In [71]:
raceData = df.iloc[:,[0,8]]
genderData = df.iloc[:,[0,9]]

raceGroup = raceData.groupby('race')
print(raceGroup.describe())

genderGroup = genderData.groupby('gender')
print(genderGroup.describe())

                         age                                                \
                       count       mean        std   min   25%   50%   75%
race
 Amer-Indian-Eskimo    311.0  37.173633  12.447130  17.0  28.0  35.0  45.5
 Asian-Pac-Islander   1039.0  37.746872  12.825133  17.0  28.0  36.0  45.0
 Black                3124.0  37.767926  12.759290  17.0  28.0  36.0  46.0
 Other                 271.0  33.457565  11.538865  17.0  25.0  31.0  41.0
 White               27816.0  38.769881  13.782306  17.0  28.0  37.0  48.0


                      max
race
 Amer-Indian-Eskimo  82.0
 Asian-Pac-Islander  90.0
 Black               90.0
 Other               77.0
 White               90.0
             age
           count       mean        std   min   25%   50%   75%   max
gender
 Female  10771.0  36.858230  14.013697  17.0  25.0  35.0  46.0  90.0
 Male    21790.0  39.433547  13.370630  17.0  29.0  38.0  48.0  90.0

In [72]:
#7.	Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? 
#Consider as married those who have a marital-status starting with Married (Married-civ-spouse, 
#Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.

df['marital-status'].value_counts()

 Married-civ-spouse       14976
 Never-married            10683
 Divorced                  4443
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: marital-status, dtype: int64

In [78]:
#8. What is the maximum number of hours a person works per week (hours-per-week feature)? 
#How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?



max_load = df['hours-per-week'].max()
print("Max time - {0} hours./week.".format(max_load))

num_of_people = df[df['hours-per-week'] == max_load].shape[0]
print("Total number of such hard workers {0}".format(num_of_people))

rich_share = float(df[(df['hours-per-week'] == max_load)
                 & (df['income'] == '>50K')].shape[0]) / num_of_people
print("Percentage of rich among them {0}%".format(int(100 * rich_share)))

Max time - 99 hours./week.
Total number of such hard workers 85
Percentage of rich among them 0%

In [75]:
#9.Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?

data1 = df.groupby(['native-country','income'])['hours-per-week'].mean().reset_index()
data1

    native-country  income  hours-per-week
0         Cambodia   <=50K       41.416667
1         Cambodia    >50K       40.000000
2           Canada   <=50K       37.914634
3           Canada    >50K       45.641026
4            China   <=50K       37.381818
..             ...     ...             ...
75   United-States    >50K       45.505369
76         Vietnam   <=50K       37.193548
77         Vietnam    >50K       39.200000
78      Yugoslavia   <=50K       41.600000
79      Yugoslavia    >50K       49.500000

[80 rows x 3 columns]

In [76]:
#10. Find out the total number of hours worked and mean salary as per different occupations.

data1 = df.groupby(['native-country'])['hours-per-week'].sum().reset_index()
data1.T

,0,1,2,3,4,5,6,7,8,9,...,31,32,33,34,35,36,37,38,39,40
native-country,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,Ecuador,El-Salvador,England,France,...,Portugal,Puerto-Rico,Scotland,South,Taiwan,Thailand,Trinadad&Tobago,United-States,Vietnam,Yugoslavia
hours-per-week,777,4889,2834,2305,3720,2973,1108,3900,3765,1307,...,1550,4397,495,3393,1983,818,710,1179861,2502,713